from pyfirmata2 import Arduino        
import time                           

board = Arduino('COM4')
print("เริ่มการทำงาน")

# servo1 = board.get_pin('d:2:s')
# servo2 = board.get_pin('d:3:s')
# servo3 = board.get_pin('d:4:s')
servo4 = board.get_pin('d:5:s') #เปิดเฉพาะอันที่ใช้เทส ไม่งั้นถ้าไม่สั่งมันจะส่งค่าเป็น 0 ให้ servo

print("📍 เริ่มควบคุมเซอร์โวมอเตอร์ที่ D9 (Ctrl-C เพื่อหยุด)")

try:
    while True:
        servo4.write(85)
        # servo2.write(166)
        # servo3.write(37)
        # servo4.write(80)
        time.sleep(1)

except KeyboardInterrupt:
    print("\n ผู้ใช้สั่งหยุดการทำงาน")

finally:
    board.exit()  # ปิดพอร์ตอย่างปลอดภัยเมื่อจบโปรแกรม
